research/workflow_runs/rapid_core_reproduction_utility_2026-07-15/stage2/runs/effectslice_attempt_2/experiment_results/confirmation_v3/planted/r013/B/scorer_calls/budget-final/candidate.patch
--- a/toolformer_filter.py
+++ b/toolformer_filter.py
@@ -13,4 +13,41 @@
 ) -> tuple[np.ndarray, np.ndarray]:
     """Return an ordered keep mask and one finite margin per proposed call."""
 
-    raise NotImplementedError("implement the paper-core reproduction task")
+    # Input validation
+    if isinstance(tau_filter, bool):
+        raise ValueError("tau_filter must not be a boolean")
+    if not isinstance(tau_filter, (int, float, np.integer, np.floating)):
+        raise ValueError("tau_filter must be a number")
+    if tau_filter < 0:
+        raise ValueError("tau_filter must be nonnegative")
+    if not np.isfinite(tau_filter):
+        raise ValueError("tau_filter must be finite")
+    
+    arrays = [logp_with_result, logp_call_only, logp_no_call]
+    names = ["logp_with_result", "logp_call_only", "logp_no_call"]
+    for arr, name in zip(arrays, names):
+        if not isinstance(arr, np.ndarray):
+            raise ValueError(f"{name} must be a numpy array")
+        if arr.ndim != 2:
+            raise ValueError(f"{name} must be a 2D matrix")
+        if arr.shape[0] == 0 or arr.shape[1] == 0:
+            raise ValueError(f"{name} must not be empty")
+        if not np.all(np.isfinite(arr)):
+            raise ValueError(f"{name} contains nonfinite values")
+        if np.any(arr > 0):
+            raise ValueError(f"{name} contains positive values (must be nonpositive)")
+    
+    shape = logp_with_result.shape
+    if logp_call_only.shape != shape or logp_no_call.shape != shape:
+        raise ValueError("All input matrices must have the same shape")
+    
+    sum_with = np.sum(logp_with_result, axis=1)
+    sum_call = np.sum(logp_call_only, axis=1)
+    sum_no = np.sum(logp_no_call, axis=1)
+    
+    margin = sum_with - sum_no
+    call_benefit = sum_with - sum_call
+    
+    keep_mask = (margin > tau_filter) & (call_benefit > 0)
+    
+    return keep_mask, margin
